# StairsActualRiserHeightGreaterThanMaximumFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairsActualRiserHeightGreaterThanMaximumFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Computed actual riser height of stairs is greater than maximum riser height defined in stairs type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairsActualRiserHeightGreaterThanMaximumFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsActualRiserHeightGreaterThanMaximumFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairsActualRiserHeightGreaterThanMaximumFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace